#### Pandas :

> Open source data analysis and manipulation tool built on top of the Python.

> It provides easy-to-use, high-performance data structures and data analysis tools, primarily for handling tabular data (like spreadsheets or databases) in a structured form.


> Pandas strengthens Python by giving the popular programming language the capability to work with spreadsheet-like data enabling fast loading, aligning, manipulating, and merging


#### Key Features of Pandas:

1. Data alignment: Automatically aligns data based on row/column labels, preventing misalignment issues.

2. Handling missing data: Pandas has built-in methods for handling missing or NaN (Not a Number) values.

3. Flexible reshaping: You can reshape, pivot, and transform data using methods like melt, pivot, and stack.

4. Powerful indexing: Pandas supports both row and column indexing, making it easier to manipulate data efficiently.

5. Merge and join: It provides methods like merge() and join() for combining data from different sources.

6. Groupby functionality: You can group data by one or more columns and apply aggregation functions to it (e.g., sum, mean, count).

7. Time series support: Pandas has excellent support for time series data, allowing easy handling of dates, times, and frequency-based data.

![alt text](pandas_dtype.png "Title")

In [2]:
import pandas as pd

In [3]:
# 1-D array => Series
# 2-D array => Dataframe
# 3-D array => Panel (will be deprecreated in latest version and replaced by Dataframe)

In [4]:
# Series 
series = pd.Series() # Empty Series 
print(series)
print(type(series))

Series([], dtype: object)
<class 'pandas.core.series.Series'>

In [5]:
series = pd.Series([10,20,30,40,50]) 
print(series)
print(type(series))
print(series[1])

series = pd.Series([10,20,30,40,50], index=[1,2,3,4,5]) 
print(series)
print(series[1])
print(series[2:])

0    10
1    20
2    30
3    40
4    50
dtype: int64
<class 'pandas.core.series.Series'>
20
1    10
2    20
3    30
4    40
5    50
dtype: int64
10
3    30
4    40
5    50
dtype: int64

In [6]:
dictS = {'a': 10, 'b':20, 'c':30, 'd':40}
series = pd.Series(dictS)
print(series)
print(series['a'])   # Accesing the values through index labels
print(series[0]) # Accessing through index positions
print(series[['a','c']]) # Accessing the subset of index labels
print(series[:4]) # Slicing the data

a    10
b    20
c    30
d    40
dtype: int64
10
10
a    10
c    30
dtype: int64
a    10
b    20
c    30
d    40
dtype: int64

C:\Users\HP\AppData\Local\Temp\ipykernel_16080\4203875876.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(series[0]) # Accessing through index positions

In [7]:
seriesConstant = pd.Series(0, index=[1,2,3,4,5,6])
print(seriesConstant)

1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [8]:
# copy 
seriesCopy = seriesConstant.copy()
print(seriesCopy)

1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [9]:
# Dataframe => representation of data in row, col format. mutable

df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [10]:
df = pd.DataFrame([10, 20, 30, 40, 50])  # 1-D list => row = no.of elemnts = 5 , col=1
print(df)

    0
0  10
1  20
2  30
3  40
4  50

In [11]:
df = pd.DataFrame([[10], [30, 40], [50, 60]])  # 2-D list => row = no.of elemnts = 3 , col=2
print(df)

    0     1
0  10   NaN
1  30  40.0
2  50  60.0

In [12]:
df = pd.DataFrame([[10], [30, 40], [50, 60]], index=['r1', 'r2', 'r3'], columns=['col1', 'col2'])  # 2-D list => row = no.of elemnts = 3 , col=2
print(df)

    col1  col2
r1    10   NaN
r2    30  40.0
r3    50  60.0

In [13]:
# Accessing dataframe data

df['col1']   # Accesing the column 'col1'

r1    10
r2    30
r3    50
Name: col1, dtype: int64

In [14]:
df.col1  # Using dot operator, Accesing the column 'col1'

r1    10
r2    30
r3    50
Name: col1, dtype: int64

In [15]:
# Accesing rows 

# .loc and .iloc
# loc => Accessing rows by labels (index labels)
# iloc => Accessing rows by positions (index position)

print(df.loc['r1']) # Access row 1 : loc

print(df.iloc[0]) # Access the first row : iloc

col1    10.0
col2     NaN
Name: r1, dtype: float64
col1    10.0
col2     NaN
Name: r1, dtype: float64

In [16]:
print(df.loc['r1', 'col1']) # Access row 1 and within row 1 access column 1 values: loc

print(df.iloc[0, 0]) # Access fisrt row and within row 1 access column 1 values: : iloc

10
10

In [17]:
# Accessing multiple rows and column values
df.loc['r1':'r2', ['col1']]  # Access multiple rows and for each row fetch fisrt column

    col1
r1    10
r2    30

In [18]:
print(df.iloc[0:1, [0]])
print(df.iloc[0:1, 0])  # Access multiple rows and for each row fetch fisrt column 
print(df.iloc[0:2, 0:2])

    col1
r1    10
r1    10
Name: col1, dtype: int64
    col1  col2
r1    10   NaN
r2    30  40.0

In [19]:
# Reading CSV into dataframe

import pandas as pd

teamdata = pd.read_csv("team.csv") 
teamdata

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
454,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
455,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
458,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [20]:
teamdata.shape

(459, 9)

In [21]:
teamdata.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [22]:
teamdata.tail(2)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
458,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [23]:
teamdata.index

RangeIndex(start=0, stop=459, step=1)

In [24]:
teamdata.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [25]:
print(teamdata.values)
print(type(teamdata.values))

[['Avery Bradley' 'Boston Celtics' 0.0 ... 180.0 'Texas' 7730337.0]
 ['Jae Crowder' 'Boston Celtics' 99.0 ... 235.0 'Marquette' 6796117.0]
 ['John Holland' 'Boston Celtics' 30.0 ... 205.0 'Boston University' nan]
 ...
 ['Tibor Pleiss' 'Utah Jazz' 21.0 ... 256.0 nan 2900000.0]
 ['Jeff Withey' 'Utah Jazz' 24.0 ... 231.0 'Kansas' 947276.0]
 [nan nan nan ... nan nan nan]]
<class 'numpy.ndarray'>

In [26]:
teamdata.axes

[RangeIndex(start=0, stop=459, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

In [27]:
teamdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 459 entries, 0 to 458
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      458 non-null    object
 1   Team      458 non-null    object
 2   Number    458 non-null    float64
 3   Position  458 non-null    object
 4   Age       458 non-null    float64
 5   Height    458 non-null    object
 6   Weight    458 non-null    float64
 7   College   374 non-null    object
 8   Salary    447 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.4+ KB

In [28]:
# Access data 

# name = teamdata['Name'] # Single Column
name = teamdata[['Name']] # Single Column
name.head(2)

            Name
0  Avery Bradley
1    Jae Crowder

In [29]:
#name = teamdata[['Name', 'Team']] # Multi Column
name = teamdata[["Name", "Team"]] # Multi Column
name.head(2)

            Name            Team
0  Avery Bradley  Boston Celtics
1    Jae Crowder  Boston Celtics

In [30]:
teamdata.head(2)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0

In [31]:
teamdata.insert(8, column="Qualification", value="Higher School") # in-place operation
teamdata.head(2)

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Higher School,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Higher School,6796117.0

In [32]:
teamdata['Qualification'] = 'Senior Secondary'
teamdata.head(2)

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Senior Secondary,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Senior Secondary,6796117.0

In [33]:
teamdata['Salary'].value_counts()

Salary
947276.0      31
845059.0      18
525093.0      13
981348.0       6
16407500.0     5
              ..
2100000.0      1
1252440.0      1
2891760.0      1
3272091.0      1
900000.0       1
Name: count, Length: 310, dtype: int64

In [34]:
teamdata.dropna(how='all', inplace=True)

In [35]:
teamdata

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Senior Secondary,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Senior Secondary,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,Senior Secondary,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,Senior Secondary,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,Senior Secondary,5000000.0
...,...,...,...,...,...,...,...,...,...,...
454,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,Senior Secondary,2433333.0
455,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,Senior Secondary,900000.0
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,Senior Secondary,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,Senior Secondary,947276.0
458,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Senior Secondary,NaN

In [36]:
droppedNA = teamdata.dropna(subset=["Name", "Team"], inplace=False)
droppedNA

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Senior Secondary,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Senior Secondary,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,Senior Secondary,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,Senior Secondary,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,Senior Secondary,5000000.0
...,...,...,...,...,...,...,...,...,...,...
453,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,Senior Secondary,2239800.0
454,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,Senior Secondary,2433333.0
455,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,Senior Secondary,900000.0
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,Senior Secondary,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,Senior Secondary,947276.0

In [37]:
teamdata.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,Senior Secondary,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,Senior Secondary,947276.0
458,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Senior Secondary,NaN

In [38]:
# Pandas option to show all rows and columns

#pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
#pd.set_option('display.max_colwidth', None)

# reset the options
pd.reset_option('display.max_rows')
pd.reset_option('display.max_columns')
pd.reset_option('display.max_colwidth')

In [39]:
teamdata

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Senior Secondary,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Senior Secondary,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,Senior Secondary,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,Senior Secondary,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,Senior Secondary,5000000.0
...,...,...,...,...,...,...,...,...,...,...
454,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,Senior Secondary,2433333.0
455,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,Senior Secondary,900000.0
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,Senior Secondary,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,Senior Secondary,947276.0
458,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Senior Secondary,NaN

In [40]:
# Replacing NaN with default values, will be deprecated in pandas 3.0
# Issue : https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

#droppedNA["Height"].fillna(0, inplace=True)
#droppedNA["Height"] = droppedNA["Height"].fillna(0)
droppedNA.fillna({"Height": 0}, inplace=True)

droppedNA["Weight"].fillna(0, inplace=True)
droppedNA["Salary"].fillna(0, inplace=True)
droppedNA["College"].fillna("Not Available", inplace=True)


droppedNA

C:\Users\HP\AppData\Local\Temp\ipykernel_16080\4258871110.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  droppedNA.fillna({"Height": 0}, inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_16080\4258871110.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  droppedNA["Weight"].fillna(0, inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_16080\4258871110.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  droppedNA["Weight"].fillna(0, inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_16080\4258871110.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  droppedNA["Salary"].fillna(0, inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_16080\4258871110.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  droppedNA["Salary"].fillna(0, inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_16080\4258871110.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  droppedNA["College"].fillna("Not Available", inplace=True)
C:\Users\HP\AppData\Local\Temp\ipykernel_16080\4258871110.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  droppedNA["College"].fillna("Not Available", inplace=True)

,Name,Team,Number,Position,Age,Height,Weight,College,Qualification,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,Senior Secondary,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,Senior Secondary,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,Senior Secondary,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,Senior Secondary,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,Not Available,Senior Secondary,5000000.0
...,...,...,...,...,...,...,...,...,...,...
453,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,Senior Secondary,2239800.0
454,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,Senior Secondary,2433333.0
455,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,Not Available,Senior Secondary,900000.0
456,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,Not Available,Senior Secondary,2900000.0
457,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,Senior Secondary,947276.0

In [41]:
# Sorting the data 
# sort_values()
# sort_index()
teamdata.sort_values("Name") # Default ascending order
teamdata.sort_values("Name", ascending=False) # Descending
teamdata.sort_values("Name", ascending=True) # ascending order

teamdata.sort_values("Name", ascending=True, na_position="first") # NaNs at the beginning
teamdata.sort_values("Name", ascending=True, na_position="last") # NaNs at the beginning

teamdata.sort_values(["Name", "Team"], ascending=[True, False], na_position="first", inplace=False) # Sorting the data on Name and then on Team
teamdata.sort_values(["Name", "Team"], ascending=[True, True], na_position="first") # Sorting the data on Name and then on Team

teamdata.sort_index(ascending=True)
teamdata.sort_index(ascending=False) # Get the another object after re-ordering, inplace=False
teamdata.sort_index(ascending=False, inplace=True) # Reordering teh original dataframe

In [42]:
teamdata.info

<bound method DataFrame.info of               Name            Team  Number Position   Age Height  Weight  \
458            NaN             NaN     NaN      NaN   NaN    NaN     NaN
457    Jeff Withey       Utah Jazz    24.0        C  26.0    7-0   231.0
456   Tibor Pleiss       Utah Jazz    21.0        C  26.0    7-3   256.0
455      Raul Neto       Utah Jazz    25.0       PG  24.0    6-1   179.0
454   Shelvin Mack       Utah Jazz     8.0       PG  26.0    6-3   203.0
..             ...             ...     ...      ...   ...    ...     ...
4    Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0
3      R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
2     John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
1      Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
0    Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0

               College     Qualification     Salary
458                NaN  Senior Secondary        NaN
457             Kansas  Senior Secondary   947276.0
456                NaN  Senior Secondary  2900000.0
455                NaN  Senior Secondary   900000.0
454             Butler  Senior Secondary  2433333.0
..                 ...               ...        ...
4                  NaN  Senior Secondary  5000000.0
3        Georgia State  Senior Secondary  1148640.0
2    Boston University  Senior Secondary        NaN
1            Marquette  Senior Secondary  6796117.0
0                Texas  Senior Secondary  7730337.0

[459 rows x 10 columns]>

In [43]:
# Aggregation Operation : Summary
# Functions like : min(), max(), count(), sum(), mean() and so on
# groupby


min_sal = teamdata['Salary'].min()
print(min_sal)

max_sal = teamdata['Salary'].max()
print(max_sal)


min_sal_per_team = teamdata.groupby('Team')['Salary'].min()
print(min_sal_per_team)

max_sal_per_team = teamdata.groupby('Team')['Salary'].max()
print(max_sal_per_team)

# Multiple aggregation on single column, Salary
sal_per_team = teamdata.groupby('Team')['Salary'].agg(['min', 'max'])
print(sal_per_team)

# Data grouping on multiple columns. Multiple aggregation on single column, Salary. 
sal_per_team = teamdata.groupby(['Name', 'Team'])['Salary'].agg(['min', 'max'])
print(sal_per_team)

# Multiple aggregation on multiple column, Weight and Salary
multi_col_agg = teamdata.groupby('Team').agg({
    'Weight' : 'min', 
    'Salary' : 'max'
    })
print(multi_col_agg)

30888.0
25000000.0
Team
Atlanta Hawks              525093.0
Boston Celtics            1148640.0
Brooklyn Nets              134215.0
Charlotte Hornets          189455.0
Chicago Bulls              525093.0
Cleveland Cavaliers        111196.0
Dallas Mavericks           525093.0
Denver Nuggets             258489.0
Detroit Pistons            111444.0
Golden State Warriors      289755.0
Houston Rockets            200600.0
Indiana Pacers             211744.0
Los Angeles Clippers       111444.0
Los Angeles Lakers         525093.0
Memphis Grizzlies          700902.0
Miami Heat                 261894.0
Milwaukee Bucks            295327.0
Minnesota Timberwolves     947276.0
New Orleans Pelicans        55722.0
New York Knicks             30888.0
Oklahoma City Thunder      222888.0
Orlando Magic              845059.0
Philadelphia 76ers         525093.0
Phoenix Suns                55722.0
Portland Trail Blazers     525093.0
Sacramento Kings           525093.0
San Antonio Spurs          200600.0
Toronto Raptors            245177.0
Utah Jazz                  900000.0
Washington Wizards         200600.0
Name: Salary, dtype: float64
Team
Atlanta Hawks             18671659.0
Boston Celtics            12000000.0
Brooklyn Nets             19689000.0
Charlotte Hornets         13500000.0
Chicago Bulls             20093064.0
Cleveland Cavaliers       22970500.0
Dallas Mavericks          16407500.0
Denver Nuggets            14000000.0
Detroit Pistons           16000000.0
Golden State Warriors     15501000.0
Houston Rockets           22359364.0
Indiana Pacers            17120106.0
Los Angeles Clippers      21468695.0
Los Angeles Lakers        25000000.0
Memphis Grizzlies         19688000.0
Miami Heat                22192730.0
Milwaukee Bucks           16407500.0
Minnesota Timberwolves    12700000.0
New Orleans Pelicans      15514031.0
New York Knicks           22875000.0
Oklahoma City Thunder     20158622.0
Orlando Magic             11250000.0
Philadelphia 76ers         6500000.0
Phoenix Suns              13500000.0
Portland Trail Blazers     8042895.0
Sacramento Kings          15851950.0
San Antonio Spurs         19689000.0
Toronto Raptors           13600000.0
Utah Jazz                 15409570.0
Washington Wizards        15851950.0
Name: Salary, dtype: float64
                              min         max
Team
Atlanta Hawks            525093.0  18671659.0
Boston Celtics          1148640.0  12000000.0
Brooklyn Nets            134215.0  19689000.0
Charlotte Hornets        189455.0  13500000.0
Chicago Bulls            525093.0  20093064.0
Cleveland Cavaliers      111196.0  22970500.0
Dallas Mavericks         525093.0  16407500.0
Denver Nuggets           258489.0  14000000.0
Detroit Pistons          111444.0  16000000.0
Golden State Warriors    289755.0  15501000.0
Houston Rockets          200600.0  22359364.0
Indiana Pacers           211744.0  17120106.0
Los Angeles Clippers     111444.0  21468695.0
Los Angeles Lakers       525093.0  25000000.0
Memphis Grizzlies        700902.0  19688000.0
Miami Heat               261894.0  22192730.0
Milwaukee Bucks          295327.0  16407500.0
Minnesota Timberwolves   947276.0  12700000.0
New Orleans Pelicans      55722.0  15514031.0
New York Knicks           30888.0  22875000.0
Oklahoma City Thunder    222888.0  20158622.0
Orlando Magic            845059.0  11250000.0
Philadelphia 76ers       525093.0   6500000.0
Phoenix Suns              55722.0  13500000.0
Portland Trail Blazers   525093.0   8042895.0
Sacramento Kings         525093.0  15851950.0
San Antonio Spurs        200600.0  19689000.0
Toronto Raptors          245177.0  13600000.0
Utah Jazz                900000.0  15409570.0
Washington Wizards       200600.0  15851950.0
                                               min         max
Name            Team
Aaron Brooks    Chicago Bulls            2250000.0   2250000.0
                Sacramento Kings         1250000.0   1250000.0
Aaron Gordon    Orlando Magic            4171680.0   4171680.0
Aaron Harrison  Charlotte Hornets         525093.0    525093.0
Adreian Payne   Minnesota Timberwolves   1938840.0   1938840.0
...                                            ...         ...
Wilson Chandler Denver Nuggets          10449438.0  10449438.0
Xavier Munford  Memphis Grizzlies              NaN         NaN
Zach LaVine     Minnesota Timberwolves   2148360.0   2148360.0
Zach Randolph   Memphis Grizzlies        9638555.0   9638555.0
Zaza Pachulia   Dallas Mavericks         5200000.0   5200000.0

[458 rows x 2 columns]
                        Weight      Salary
Team
Atlanta Hawks            172.0  18671659.0
Boston Celtics           180.0  12000000.0
Brooklyn Nets            175.0  19689000.0
Charlotte Hornets        184.0  13500000.0
Chicago Bulls            161.0  20093064.0
Cleveland Cavaliers      179.0  22970500.0
Dallas Mavericks         185.0  16407500.0
Denver Nuggets           175.0  14000000.0
Detroit Pistons          172.0  16000000.0
Golden State Warriors    175.0  15501000.0
Houston Rockets          185.0  22359364.0
Indiana Pacers           180.0  17120106.0
Los Angeles Clippers     175.0  21468695.0
Los Angeles Lakers       175.0  25000000.0
Memphis Grizzlies        165.0  19688000.0
Miami Heat               165.0  22192730.0
Milwaukee Bucks          190.0  16407500.0
Minnesota Timberwolves   189.0  12700000.0
New Orleans Pelicans     170.0  15514031.0
New York Knicks          195.0  22875000.0
Oklahoma City Thunder    185.0  20158622.0
Orlando Magic            169.0  11250000.0
Philadelphia 76ers       175.0   6500000.0
Phoenix Suns             175.0  13500000.0
Portland Trail Blazers   173.0   8042895.0
Sacramento Kings         161.0  15851950.0
San Antonio Spurs        185.0  19689000.0
Toronto Raptors          190.0  13600000.0
Utah Jazz                179.0  15409570.0
Washington Wizards       190.0  15851950.0

In [44]:
# Merging and Joins 

sales1 = pd.read_csv("Sales1.csv")
sales2 = pd.read_csv("Sales2.csv")

In [45]:
sales1

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [46]:
sales2

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

In [47]:
sales1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Customer ID  250 non-null    int64
 1   Food ID      250 non-null    int64
dtypes: int64(2)
memory usage: 4.0 KB

In [48]:
sales2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Customer ID  250 non-null    int64
 1   Food ID      250 non-null    int64
dtypes: int64(2)
memory usage: 4.0 KB

In [49]:
# concat operation
pd.concat([sales1, sales2])

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[500 rows x 2 columns]

In [50]:
(pd.concat([sales1, sales2])).shape

(500, 2)

In [51]:
pd.concat([sales1, sales2], keys=["sales1", "sales2"])

            Customer ID  Food ID
sales1 0            537        9
       1             97        4
       2            658        1
       3            202        2
       4            155        9
...                 ...      ...
sales2 245          783       10
       246          556       10
       247          547        9
       248          252        9
       249          249        6

[500 rows x 2 columns]

In [52]:
# Merging (kind of SQL joins)
# merge() - inner, outer, left snd right

sales1.merge(sales2, how="inner", on="Customer ID")

    Customer ID  Food ID_x  Food ID_y
0           537          9          5
1           155          9          3
2           503          5          8
3           503          5          9
4           155          1          3
..          ...        ...        ...
57          945          5          4
58          343          3          5
59          343          3          2
60          343          3          7
61          621          9          6

[62 rows x 3 columns]

In [53]:
x = sales1.merge(sales2, how="outer", on="Customer ID")
x

     Customer ID  Food ID_x  Food ID_y
0              3        2.0        NaN
1              8        NaN        6.0
2             10        2.0        NaN
3             13        NaN        2.0
4             20        1.0        NaN
..           ...        ...        ...
449          985        5.0        NaN
450          991        2.0        NaN
451          994        NaN        2.0
452          996        NaN       10.0
453         1000        2.0        NaN

[454 rows x 3 columns]

In [54]:
x = sales1.merge(sales2, how="left", on="Customer ID")
x

     Customer ID  Food ID_x  Food ID_y
0            537          9        5.0
1             97          4        NaN
2            658          1        NaN
3            202          2        NaN
4            155          9        3.0
..           ...        ...        ...
252          413          9        NaN
253          926          6        NaN
254          134          3        NaN
255          396          6        NaN
256          535         10        NaN

[257 rows x 3 columns]

In [55]:
x = sales1.merge(sales2, how="right", on="Customer ID")
x

     Customer ID  Food ID_x  Food ID_y
0            688        NaN         10
1            813        NaN          7
2            495        NaN         10
3            189        4.0          5
4            267        NaN          3
..           ...        ...        ...
254          783        6.0         10
255          556        NaN         10
256          547        NaN          9
257          252        NaN          9
258          249        9.0          6

[259 rows x 3 columns]

In [56]:
sales1.merge(sales2, how="inner", on="Customer ID", suffixes=['-s1', '-s2'])

    Customer ID  Food ID-s1  Food ID-s2
0           537           9           5
1           155           9           3
2           503           5           8
3           503           5           9
4           155           1           3
..          ...         ...         ...
57          945           5           4
58          343           3           5
59          343           3           2
60          343           3           7
61          621           9           6

[62 rows x 3 columns]

In [57]:
df = pd.read_csv("employees.csv")
df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [59]:
df = pd.read_csv("employees.csv", parse_dates=['Start Date', 'Last Login Time']) # default date formst : YYYY-mm-dd HH:MM:SS
                                                                                 # 3/31/1996 => dd/mm/YYYY
df['Gender'] = df['Gender'].astype('category')
df['Senior Management'] = df['Senior Management'].astype('bool')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 49.1+ KB

C:\Users\HP\AppData\Local\Temp\ipykernel_16080\951895260.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df = pd.read_csv("employees.csv", parse_dates=['Start Date', 'Last Login Time']) # default date formst : YYYY-mm-dd HH:MM:SS

In [60]:
df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2025-02-22 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2025-02-22 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2025-02-22 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2025-02-22 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2025-02-22 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2025-02-22 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2025-02-22 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2025-02-22 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2025-02-22 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2025-02-22 18:24:00,129949,10.169,True,Sales

In [63]:

df['Team'] == 'Legal'

0      False
1      False
2      False
3      False
4      False
5       True
6      False
7      False
8      False
9      False
10     False
11      True
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20      True
21     False
22     False
23     False
24     False
25     False
26     False
27      True
28     False
29      True
30     False
31     False
32     False
33     False
34     False
35     False
36     False
37     False
38     False
39     False
40     False
41     False
42      True
43     False
44     False
45     False
46     False
47     False
48     False
49     False
50     False
51     False
52     False
53     False
54     False
55     False
56     False
57     False
58     False
59     False
60     False
61     False
62     False
63     False
64     False
65     False
66     False
67     False
68     False
69     False
70     False
71     False
72     False
73     False
74     False
75     False
76     False
77     False
78     False
79     False
80     False
81      True
82     False
83     False
84     False
85     False
86     False
87     False
88      True
89      True
90      True
91     False
92     False
93      True
94      True
95     False
96     False
97     False
98     False
99     False
100    False
101    False
102    False
103    False
104    False
105    False
106     True
107     True
108     True
109    False
110     True
111    False
112    False
113    False
114    False
115    False
116     True
117    False
118    False
119    False
120    False
121    False
122    False
123    False
124    False
125    False
126    False
127    False
128    False
129    False
130    False
131    False
132    False
133    False
134    False
135     True
136     True
137    False
138    False
139    False
140    False
141    False
142    False
143    False
144    False
145    False
146    False
147     True
148    False
149    False
150    False
151    False
152    False
153    False
154    False
155    False
156    False
157    False
158    False
159    False
160    False
161    False
162     True
163    False
164    False
165     True
166    False
167    False
168    False
169    False
170    False
171    False
172    False
173    False
174    False
175    False
176    False
177    False
178    False
179    False
180    False
181    False
182    False
183    False
184    False
185     True
186    False
187    False
188     True
189    False
190    False
191    False
192     True
193     True
194    False
195    False
196    False
197    False
198    False
199    False
200    False
201    False
202    False
203    False
204    False
205    False
206    False
207    False
208    False
209    False
210     True
211    False
212    False
213    False
214    False
215    False
216    False
217    False
218    False
219    False
220    False
221     True
222    False
223     True
224    False
225    False
226    False
227    False
228    False
229    False
230     True
231    False
232    False
233    False
234    False
235    False
236    False
237     True
238     True
239    False
240    False
241    False
242    False
243    False
244    False
245    False
246    False
247    False
248    False
249    False
250    False
251    False
252    False
253    False
254    False
255    False
256     True
257    False
258    False
259    False
260    False
261    False
262    False
263    False
264    False
265    False
266    False
267    False
268    False
269    False
270    False
271    False
272    False
273    False
274    False
275    False
276    False
277    False
278    False
279    False
280    False
281    False
282    False
283    False
284    False
285    False
286    False
287    False
288    False
289     True
290    False
291    False
292    False
293    False
294    False
295     True
296    False
297    False
298    False
299    False
300    False
301    False
302    False
303    False
304    False
305    False
306    False
307    False
308     True
309    False
310     True
311    False
312    False
313     True
314    False
315    False
316    False
317    False
318    False
319    False
320    False
321    False
322    False
323    False
324    False
325    False
326    False
327    False
328    False
329    False
330    False
331    False
332    False
333    False
334    False
335    False
336     True
337    False
338    False
339    False
340    False
341    False
342    False
343    False
344    False
345    False
346    False
347    False
348    False
349    False
350    False
351    False
352    False
353    False
354     True
355     True
356    False
357    False
358    False
359    False
360    False
361    False
362    False
363    False
364    False
365    False
366    False
367    False
368    False
369    False
370    False
371    False
372    False
373    False
374    False
375    False
376    False
377    False
378    False
379    False
380    False
381    False
382    False
383    False
384    False
385    False
386    False
387    False
388    False
389    False
390    False
391    False
392    False
393    False
394    False
395    False
396    False
397    False
398    False
399    False
400    False
401    False
402    False
403    False
404    False
405    False
406    False
407    False
408    False
409    False
410    False
411    False
412     True
413    False
414    False
415    False
416    False
417    False
418    False
419    False
420    False
421    False
422    False
423    False
424    False
425    False
426    False
427    False
428    False
429    False
430    False
431     True
432    False
433     True
434    False
435    False
436    False
437    False
438    False
439    False
440    False
441    False
442    False
443    False
444    False
445    False
446    False
447    False
448    False
449    False
450     True
451    False
452    False
453    False
454    False
455    False
456    False
457     True
458    False
459    False
460     True
461    False
462    False
463    False
464    False
465     True
466    False
467    False
468    False
469     True
470    False
471    False
472    False
473    False
474    False
475    False
476    False
477    False
478    False
479    False
480    False
481    False
482    False
483    False
484    False
485    False
486    False
487    False
488     True
489    False
490    False
491    False
492    False
493    False
494    False
495    False
496    False
497    False
498    False
499    False
500     True
501    False
502    False
503    False
504    False
505    False
506    False
507    False
508    False
509    False
510     True
511    False
512    False
513    False
514    False
515    False
516     True
517    False
518    False
519    False
520    False
521    False
522    False
523    False
524    False
525    False
526    False
527    False
528    False
529    False
530    False
531    False
532    False
533    False
534     True
535    False
536    False
537    False
538    False
539    False
540    False
541    False
542    False
543    False
544    False
545    False
546    False
547    False
548    False
549    False
550    False
551    False
552    False
553    False
554    False
555    False
556    False
557    False
558    False
559    False
560    False
561    False
562     True
563    False
564    False
565    False
566    False
567    False
568    False
569    False
570    False
571    False
572    False
573    False
574    False
575    False
576    False
577    False
578    False
579     True
580    False
581    False
582    False
583    False
584     True
585    False
586    False
587    False
588    False
589    False
590    False
591    False
592    False
593    False
594    False
595    False
596    False
597    False
598    False
599    False
600    False
601    False
602    False
603    False
604    False
605    False
606    False
607    False
608    False
609    False
610    False
611    False
612    False
613    False
614    False
615    False
616    False
617    False
618    False
619    False
620    False
621    False
622    False
623     True
624    False
625    False
626    False
627    False
628    False
629    False
630     True
631    False
632    False
633    False
634    False
635    False
636    False
637    False
638    False
639    False
640    False
641    False
642    False
643    False
644    False
645    False
646    False
647    False
648    False
649    False
650    False
651    False
652    False
653    False
654     True
655    False
656    False
657    False
658    False
659    False
660    False
661    False
662    False
663    False
664     True
665    False
666    False
667    False
668     True
669    False
670    False
671    False
672    False
673    False
674    False
675    False
676    False
677    False
678    False
679    False
680    False
681    False
682    False
683    False
684    False
685    False
686    False
687    False
688     True
689    False
690    False
691    False
692    False
693    False
694    False
695    False
696    False
697    False
698     True
699    False
700    False
701     True
702    False
703    False
704    False
705    False
706    False
707    False
708     True
709    False
710    False
711    False
712    False
713    False
714    False
715    False
716    False
717    False
718    False
719    False
720    False
721    False
722    False
723     True
724    False
725    False
726    False
727    False
728    False
729    False
730    False
731    False
732    False
733    False
734    False
735    False
736    False
737    False
738    False
739    False
740    False
741     True
742    False
743    False
744    False
745    False
746    False
747    False
748    False
749     True
750    False
751    False
752    False
753    False
754     True
755    False
756    False
757    False
758     True
759    False
760    False
761    False
762    False
763     True
764    False
765    False
766    False
767    False
768    False
769    False
770    False
771    False
772    False
773    False
774    False
775    False
776    False
777    False
778    False
779    False
780    False
781    False
782    False
783    False
784    False
785    False
786    False
787    False
788    False
789    False
790    False
791     True
792    False
793    False
794    False
795    False
796    False
797    False
798    False
799    False
800    False
801    False
802    False
803    False
804    False
805    False
806    False
807    False
808    False
809    False
810    False
811    False
812    False
813    False
814    False
815    False
816    False
817    False
818    False
819     True
820    False
821    False
822    False
823    False
824    False
825    False
826    False
827     True
828    False
829    False
830    False
831    False
832     True
833    False
834    False
835    False
836    False
837    False
838    False
839    False
840    False
841    False
842    False
843    False
844     True
845    False
846    False
847    False
848    False
849    False
850    False
851    False
852    False
853    False
854    False
855    False
856    False
857    False
858    False
859    False
860    False
861    False
862    False
863    False
864    False
865     True
866    False
867    False
868    False
869    False
870    False
871    False
872    False
873    False
874    False
875    False
876    False
877    False
878    False
879    False
880    False
881    False
882    False
883    False
884    False
885    False
886    False
887     True
888     True
889    False
890    False
891    False
892    False
893    False
894    False
895    False
896    False
897    False
898    False
899    False
900    False
901    False
902    False
903    False
904    False
905    False
906    False
907    False
908    False
909    False
910     True
911    False
912    False
913    False
914    False
915    False
916    False
917    False
918    False
919    False
920    False
921    False
922    False
923    False
924    False
925    False
926    False
927    False
928    False
929     True
930    False
931    False
932    False
933    False
934    False
935    False
936    False
937    False
938    False
939    False
940    False
941    False
942    False
943    False
944    False
945    False
946    False
947    False
948    False
949    False
950    False
951    False
952    False
953    False
954    False
955     True
956    False
957    False
958    False
959    False
960    False
961     True
962    False
963    False
964    False
965    False
966    False
967    False
968    False
969    False
970    False
971    False
972    False
973    False
974    False
975    False
976     True
977    False
978    False
979    False
980    False
981     True
982    False
983    False
984    False
985     True
986    False
987    False
988    False
989     True
990    False
991    False
992    False
993    False
994    False
995    False
996    False
997    False
998    False
999    False
Name: Team, dtype: bool

In [66]:
x = df['Team'] == 'Legal'
df[x]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2025-02-22 01:35:00,115163,10.125,False,Legal
11,Julie,Female,1997-10-26,2025-02-22 15:19:00,102508,12.637,True,Legal
20,Lois,NaN,1995-04-22,2025-02-22 19:18:00,64714,4.934,True,Legal
27,Scott,NaN,1991-07-11,2025-02-22 18:58:00,122367,5.218,False,Legal
29,Benjamin,Male,2005-01-26,2025-02-22 22:06:00,79529,7.008,True,Legal
...,...,...,...,...,...,...,...,...
961,Antonio,NaN,1989-06-18,2025-02-22 21:37:00,103050,3.050,False,Legal
976,Denise,Female,1992-10-19,2025-02-22 05:42:00,137954,4.195,True,Legal
981,James,Male,1993-01-15,2025-02-22 17:19:00,148985,19.280,False,Legal
985,Stephen,NaN,1983-07-10,2025-02-22 20:10:00,85668,1.909,False,Legal
989,Justin,NaN,1991-02-10,2025-02-22 16:58:00,38344,3.794,False,Legal

In [68]:
f1 = df['Team'] == 'Legal'
f2 = df['Gender'] == 'Male'

df[f1 & f2]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2025-02-22 01:35:00,115163,10.125,False,Legal
29,Benjamin,Male,2005-01-26,2025-02-22 22:06:00,79529,7.008,True,Legal
81,Christopher,Male,2008-03-30,2025-02-22 10:52:00,47369,14.822,False,Legal
94,Harry,Male,1981-08-26,2025-02-22 15:16:00,130620,7.030,False,Legal
106,Paul,Male,1993-08-04,2025-02-22 19:25:00,42146,3.046,False,Legal
107,Steven,Male,2013-04-23,2025-02-22 22:12:00,68680,16.565,False,Legal
116,NaN,Male,1991-06-22,2025-02-22 20:58:00,76189,18.988,True,Legal
136,Henry,Male,1995-04-24,2025-02-22 04:18:00,43542,19.687,False,Legal
147,Philip,Male,2008-07-17,2025-02-22 13:30:00,89227,3.996,False,Legal
162,Arthur,Male,1998-04-13,2025-02-22 11:28:00,89786,14.422,True,Legal
188,Charles,Male,2000-10-14,2025-02-22 21:40:00,71749,15.931,False,Legal
221,Gregory,Male,2000-01-29,2025-02-22 06:01:00,109564,3.845,False,Legal
223,Daniel,Male,2010-04-30,2025-02-22 03:48:00,106947,15.866,True,Legal
238,Kevin,Male,1982-03-25,2025-02-22 07:31:00,35061,5.128,False,Legal
295,Jesse,Male,1981-03-02,2025-02-22 19:26:00,79582,3.873,False,Legal
310,Harold,Male,1990-02-20,2025-02-22 23:00:00,66775,2.158,True,Legal
336,Mark,Male,2007-01-22,2025-02-22 14:37:00,75150,12.182,True,Legal
431,Charles,Male,1999-12-16,2025-02-22 20:28:00,104014,7.077,False,Legal
450,Willie,Male,2009-08-22,2025-02-22 13:03:00,55038,19.691,False,Legal
469,Stephen,Male,2015-05-09,2025-02-22 19:07:00,141958,9.078,True,Legal
488,Robert,Male,2007-03-11,2025-02-22 11:20:00,135882,19.944,False,Legal
510,Frank,Male,2003-04-27,2025-02-22 12:04:00,140303,17.070,False,Legal
579,Harold,Male,2010-10-18,2025-02-22 20:45:00,65673,1.187,True,Legal
584,Jack,Male,2012-05-30,2025-02-22 03:17:00,70367,18.266,True,Legal
630,Michael,Male,1988-07-13,2025-02-22 13:48:00,47079,2.617,False,Legal
654,Carl,Male,1984-12-14,2025-02-22 20:49:00,63395,11.411,False,Legal
664,Timothy,Male,2010-10-06,2025-02-22 22:49:00,49473,12.463,False,Legal
668,James,Male,2001-12-05,2025-02-22 07:06:00,67789,17.105,True,Legal
688,Brian,Male,2007-04-07,2025-02-22 22:47:00,93901,17.821,True,Legal
708,Steve,Male,2002-01-11,2025-02-22 21:17:00,51821,1.197,True,Legal
791,Joseph,Male,1982-11-04,2025-02-22 21:46:00,126010,19.601,False,Legal
819,Kenneth,Male,1985-12-14,2025-02-22 06:55:00,47232,17.862,True,Legal
832,Keith,Male,2003-02-12,2025-02-22 15:02:00,120672,19.467,False,Legal
887,David,Male,2009-12-05,2025-02-22 08:48:00,92242,15.407,False,Legal
981,James,Male,1993-01-15,2025-02-22 17:19:00,148985,19.280,False,Legal

In [70]:
f1 = df['Team'] == 'Legal'
f2 = df['Gender'] == 'Male'
f3 = df['Gender'] == 'Female'

df[f1 & (f2|f3)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,2025-02-22 01:35:00,115163,10.125,False,Legal
11,Julie,Female,1997-10-26,2025-02-22 15:19:00,102508,12.637,True,Legal
29,Benjamin,Male,2005-01-26,2025-02-22 22:06:00,79529,7.008,True,Legal
42,Beverly,Female,1998-09-09,2025-02-22 20:26:00,121918,15.835,False,Legal
81,Christopher,Male,2008-03-30,2025-02-22 10:52:00,47369,14.822,False,Legal
...,...,...,...,...,...,...,...,...
910,Melissa,Female,2002-10-22,2025-02-22 01:20:00,45223,8.879,True,Legal
929,Theresa,Female,2001-04-27,2025-02-22 21:17:00,75661,1.079,True,Legal
955,Sarah,Female,2014-08-17,2025-02-22 23:08:00,127118,11.176,False,Legal
976,Denise,Female,1992-10-19,2025-02-22 05:42:00,137954,4.195,True,Legal
981,James,Male,1993-01-15,2025-02-22 17:19:00,148985,19.280,False,Legal

In [72]:
f1 = df['Team'] == 'Legal'
f3 = df['Gender'] == 'Female'
f4 = df['Senior Management'] == True

df[f1 & f3 & f4]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
11,Julie,Female,1997-10-26,2025-02-22 15:19:00,102508,12.637,True,Legal
88,Donna,Female,1991-11-27,2025-02-22 13:59:00,64088,6.155,True,Legal
135,Gloria,Female,2007-06-29,2025-02-22 05:34:00,134148,8.833,True,Legal
165,NaN,Female,2014-03-23,2025-02-22 13:28:00,59148,9.061,True,Legal
185,Sandra,Female,1983-01-19,2025-02-22 07:25:00,42090,8.842,True,Legal
193,Rebecca,Female,1995-02-18,2025-02-22 06:50:00,109259,4.443,True,Legal
210,Ruth,Female,1986-08-12,2025-02-22 19:29:00,44639,9.148,True,Legal
289,Jessica,Female,1985-09-27,2025-02-22 13:35:00,75145,6.388,True,Legal
308,Cheryl,Female,2009-09-08,2025-02-22 10:16:00,81308,2.196,True,Legal
313,Judy,Female,1991-07-01,2025-02-22 02:33:00,109510,13.457,True,Legal
354,Elizabeth,Female,2005-11-10,2025-02-22 04:56:00,106406,1.782,True,Legal
433,Wanda,Female,2008-07-20,2025-02-22 13:44:00,65362,7.132,True,Legal
516,Gloria,Female,1992-04-12,2025-02-22 20:26:00,66224,15.979,True,Legal
623,Irene,Female,2006-11-29,2025-02-22 14:14:00,125018,9.601,True,Legal
754,Lisa,Female,2007-04-11,2025-02-22 01:04:00,128042,2.030,True,Legal
763,Jacqueline,Female,2008-07-27,2025-02-22 12:08:00,125298,3.019,True,Legal
888,Marilyn,Female,2007-10-08,2025-02-22 00:32:00,115149,11.934,True,Legal
910,Melissa,Female,2002-10-22,2025-02-22 01:20:00,45223,8.879,True,Legal
929,Theresa,Female,2001-04-27,2025-02-22 21:17:00,75661,1.079,True,Legal
976,Denise,Female,1992-10-19,2025-02-22 05:42:00,137954,4.195,True,Legal

In [74]:
f1 = df['Team'] == 'Legal'
f3 = df['Gender'] == 'Female'
f4 = df['Senior Management'] == True

df[(f1 & f3) | f4]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2025-02-22 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2025-02-22 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2025-02-22 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2025-02-22 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2025-02-22 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2025-02-22 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2025-02-22 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2025-02-22 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2025-02-22 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2025-02-22 18:24:00,129949,10.169,True,Sales

In [80]:
df[df['Start Date'] > '2016-01-01']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Lillian,Female,2016-06-05,2025-02-22 06:09:00,59414,1.256,False,Product
39,NaN,Male,2016-01-29,2025-02-22 02:33:00,122173,7.797,True,Client Services
89,Janice,Female,2016-03-12,2025-02-22 00:40:00,51082,11.955,False,Legal
98,Tina,Female,2016-06-16,2025-02-22 19:47:00,100705,16.961,True,Marketing
121,Kathleen,NaN,2016-05-09,2025-02-22 08:55:00,119735,18.740,False,Product
143,Teresa,NaN,2016-01-28,2025-02-22 10:55:00,140013,8.689,True,Engineering
239,Lillian,NaN,2016-05-12,2025-02-22 15:43:00,64164,17.612,False,Human Resources
426,Todd,Male,2016-03-16,2025-02-22 14:45:00,134408,3.560,True,Human Resources
444,NaN,Male,2016-05-24,2025-02-22 21:17:00,76409,7.008,True,Distribution
451,Terry,NaN,2016-07-15,2025-02-22 00:29:00,140002,19.490,True,Marketing
496,Johnny,Male,2016-02-26,2025-02-22 19:39:00,76394,5.437,True,Marketing
684,Alice,Female,2016-01-21,2025-02-22 17:07:00,117787,10.485,False,NaN
726,Daniel,Male,2016-02-29,2025-02-22 04:04:00,77287,13.000,True,NaN
742,Martin,Male,2016-02-25,2025-02-22 18:29:00,61117,2.844,False,Client Services
967,Thomas,Male,2016-03-12,2025-02-22 15:10:00,105681,19.572,False,Engineering

In [ ]:
f1 = df['Team'] == 'Legal'
f3 = df['Team'] == 'Product'
f4 = df['Team'] == 'Marketing'

df[f1 | f3 | f4]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2025-02-22 12:42:00,97308,6.945,True,Marketing
5,Dennis,Male,1987-04-18,2025-02-22 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2025-02-22 16:20:00,65476,10.012,True,Product
11,Julie,Female,1997-10-26,2025-02-22 15:19:00,102508,12.637,True,Legal
15,Lillian,Female,2016-06-05,2025-02-22 06:09:00,59414,1.256,False,Product
...,...,...,...,...,...,...,...,...
986,Donna,Female,1982-11-26,2025-02-22 07:04:00,82871,17.999,False,Marketing
989,Justin,NaN,1991-02-10,2025-02-22 16:58:00,38344,3.794,False,Legal
991,Rose,Female,2002-08-25,2025-02-22 05:12:00,134505,11.051,True,Marketing
994,George,Male,2013-06-21,2025-02-22 17:47:00,98874,4.479,True,Marketing
997,Russell,Male,2013-05-20,2025-02-22 12:39:00,96914,1.421,False,Product

In [84]:
df[df['Team'].isnull()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2025-02-22 06:53:00,61933,4.170,True,NaN
10,Louise,Female,1980-08-12,2025-02-22 09:01:00,63241,15.132,True,NaN
23,NaN,Male,2012-06-14,2025-02-22 16:19:00,125792,5.042,True,NaN
32,NaN,Male,1998-08-21,2025-02-22 14:27:00,122340,6.417,True,NaN
91,James,NaN,2005-01-26,2025-02-22 23:00:00,128771,8.309,False,NaN
109,Christopher,Male,2000-04-22,2025-02-22 10:15:00,37919,11.449,False,NaN
139,NaN,Female,1990-10-03,2025-02-22 01:08:00,132373,10.527,True,NaN
199,Jonathan,Male,2009-07-17,2025-02-22 08:15:00,130581,16.736,True,NaN
258,Michael,Male,2002-01-24,2025-02-22 03:04:00,43586,12.659,False,NaN
290,Jeremy,Male,1988-06-14,2025-02-22 18:20:00,129460,13.657,True,NaN
314,Bobby,Male,1996-03-31,2025-02-22 17:40:00,112117,6.338,False,NaN
367,Edward,Male,1989-08-04,2025-02-22 06:06:00,66067,10.957,True,NaN
382,NaN,Female,1996-04-18,2025-02-22 15:57:00,107024,12.182,True,NaN
434,Joyce,Female,1995-02-07,2025-02-22 07:38:00,50701,14.227,True,NaN
438,Jason,Male,1998-11-20,2025-02-22 14:54:00,69244,6.220,True,NaN
445,Chris,Male,2006-12-12,2025-02-22 01:57:00,71642,1.496,False,NaN
479,Richard,Male,1997-07-04,2025-02-22 11:47:00,47647,18.787,True,NaN
512,Wanda,Female,1993-04-06,2025-02-22 03:11:00,78883,19.695,False,NaN
513,Jimmy,Male,2013-11-19,2025-02-22 19:29:00,63549,19.624,False,NaN
520,Peter,Male,2003-02-22,2025-02-22 09:09:00,56580,8.411,True,NaN
567,NaN,Female,1980-04-01,2025-02-22 20:04:00,48141,12.605,True,NaN
573,Kimberly,Female,1981-12-30,2025-02-22 04:51:00,81800,5.435,True,NaN
580,Harry,Male,1985-01-27,2025-02-22 20:18:00,65482,18.089,False,NaN
626,NaN,Female,1997-04-13,2025-02-22 08:03:00,131755,2.930,True,NaN
634,Carl,Male,1987-03-30,2025-02-22 17:59:00,75598,19.289,False,NaN
635,Randy,Male,2000-09-27,2025-02-22 03:04:00,89831,13.047,True,NaN
647,Donald,Male,1988-04-06,2025-02-22 10:00:00,122920,5.320,False,NaN
669,Joseph,NaN,1982-03-28,2025-02-22 13:05:00,86564,11.879,True,NaN
684,Alice,Female,2016-01-21,2025-02-22 17:07:00,117787,10.485,False,NaN
706,Todd,Male,1993-07-04,2025-02-22 18:53:00,128175,18.473,True,NaN
726,Daniel,Male,2016-02-29,2025-02-22 04:04:00,77287,13.000,True,NaN
753,Antonio,Male,1999-06-06,2025-02-22 22:54:00,41928,5.478,True,NaN
774,NaN,Female,2000-06-18,2025-02-22 07:36:00,106428,10.867,True,NaN
781,Lawrence,Male,1995-07-03,2025-02-22 22:55:00,46378,9.127,False,NaN
794,Nicole,Female,2004-03-01,2025-02-22 17:17:00,44021,10.286,False,NaN
826,NaN,NaN,1988-08-01,2025-02-22 01:35:00,87103,5.665,True,NaN
850,Charles,Male,1997-09-03,2025-02-22 10:04:00,148291,6.002,False,NaN
851,Bobby,Male,1996-08-19,2025-02-22 01:16:00,147842,16.158,True,NaN
853,Mildred,Female,2007-04-06,2025-02-22 22:06:00,139284,11.390,True,NaN
855,Phillip,NaN,2003-10-20,2025-02-22 11:09:00,89700,2.277,True,NaN
864,Ryan,Male,2012-11-16,2025-02-22 13:47:00,57292,6.010,False,NaN
912,Joe,Male,1998-12-08,2025-02-22 10:28:00,126120,1.020,False,NaN
951,NaN,Female,2010-09-14,2025-02-22 05:19:00,143638,9.662,True,NaN

In [86]:
df[df['Team'].notnull()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2025-02-22 12:42:00,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,2025-02-22 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2025-02-22 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2025-02-22 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2025-02-22 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2025-02-22 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2025-02-22 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2025-02-22 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2025-02-22 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2025-02-22 18:24:00,129949,10.169,True,Sales

In [89]:
df[df['Start Date'].between('2016-01-01', '2016-03-31')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
39,NaN,Male,2016-01-29,2025-02-22 02:33:00,122173,7.797,True,Client Services
89,Janice,Female,2016-03-12,2025-02-22 00:40:00,51082,11.955,False,Legal
143,Teresa,NaN,2016-01-28,2025-02-22 10:55:00,140013,8.689,True,Engineering
426,Todd,Male,2016-03-16,2025-02-22 14:45:00,134408,3.560,True,Human Resources
496,Johnny,Male,2016-02-26,2025-02-22 19:39:00,76394,5.437,True,Marketing
684,Alice,Female,2016-01-21,2025-02-22 17:07:00,117787,10.485,False,NaN
726,Daniel,Male,2016-02-29,2025-02-22 04:04:00,77287,13.000,True,NaN
742,Martin,Male,2016-02-25,2025-02-22 18:29:00,61117,2.844,False,Client Services
967,Thomas,Male,2016-03-12,2025-02-22 15:10:00,105681,19.572,False,Engineering

In [94]:
df[df['Salary'].between(100000, 200000)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2025-02-22 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2025-02-22 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2025-02-22 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2025-02-22 01:35:00,115163,10.125,False,Legal
9,Frances,Female,2002-08-08,2025-02-22 06:51:00,139852,7.524,True,Business Development
...,...,...,...,...,...,...,...,...
990,Robin,Female,1987-07-24,2025-02-22 13:35:00,100765,10.982,True,Client Services
991,Rose,Female,2002-08-25,2025-02-22 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2025-02-22 08:35:00,112769,11.625,True,Finance
995,Henry,NaN,2014-11-23,2025-02-22 06:09:00,132483,16.655,False,Distribution
999,Albert,Male,2012-05-15,2025-02-22 18:24:00,129949,10.169,True,Sales

In [111]:
df = pd.read_csv("employees.csv") # default date formst : YYYY-mm-dd HH:MM:SS
df['Gender'] = df['Gender'].astype('category')
df['Senior Management'] = df['Senior Management'].astype('bool')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         934 non-null    object
 1   Gender             856 non-null    category
 2   Start Date         1001 non-null   object
 3   Last Login Time    1001 non-null   object
 4   Salary             1001 non-null   int64
 5   Bonus %            1001 non-null   float64
 6   Senior Management  1001 non-null   bool
 7   Team               958 non-null    object
dtypes: bool(1), category(1), float64(1), int64(1), object(4)
memory usage: 49.1+ KB

In [ ]:
# Incase parsing erros happen 
# errors='coerce', errors='raise', 
# errors='ignore' => deprecated

df['Start Date'] = pd.to_datetime(df['Start Date'], format='%m/%d/%Y', errors='ignore') 
df

C:\Users\HP\AppData\Local\Temp\ipykernel_16080\2537086639.py:3: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_datetime without passing `errors` and catch exceptions explicitly instead
  df['Start Date'] = pd.to_datetime(df['Start Date'], format='%m/%d/%Y', errors='ignore')

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
996,Phillip,Male,1984-01-31,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,12:39 PM,96914,1.421,False,Product
998,Larry,Male,2013-04-20,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,6:24 PM,129949,10.169,True,Sales
1000,Albert,Male,NaT,6:24 PM,129949,10.169,True,Sales